const lan = {
  REDIRECT: "جاري إعادة التوجيه...",
  RULE: {
    SERVICE_TYPE: "الرجاء تحديد نوع الخدمة",
    COUNTRY: "الرجاء تحديد بلدك أو منطقتك",
    USERNAME: "اسم المستخدم مطلوب",
    EMAIL: "البريد الإلكتروني مطلوب",
    EMAIL2: "Please enter the correct Email format.",
    PRODUCT: "الرجاء اختيار المنتج",
    PRODUCTSN: "الرجاء إدخال الرقم التسلسلي للمنتج الخاص بك",
    PRODUCTSN_LEN: "الرجاء إدخال 12 إلى 15 حرف أو أرقام",
    BIRTHDAY: "تاريخ الميلاد مطلوب",
    REQUIRED: "مطلوب",
  },
  SYS: {
    HEAD: "النظام",
    NOSERVICE: "عذراً، محادثة ASUS للبلد أو المنطقة المحددة غير متوفرة.",
    CHECK_FILESIZE: "الرجاء التحقق من حجم الصورة والملف. محدود:",
    RECONNECTED: "حالة الاتصال قد عادت إلى الوضع الطبيعي",
    UNABLE_SEND: "تعذر تحميل المرفقات",
    NO_NETWORK: "لا يوجد اتصال بالإنترنت",
    NO_NETWORK_INFO:
      "لا يوجد اتصال بالإنترنت. اتصل بالإنترنت ثم حاول مرة أخرى.",
  },
  IDLE: {
    HEAD: "لقد كنت خاملا لبعض الوقت. هل تريد متابعة الدردشة؟",
    BUTTON: "متابعة",
  },
  DISCONNECT: {
    HEAD: "انتهت الدردشة",
    BUTTON: "إنهاء",
  },
  LAYOUT: {
    PREV_STEP: "السابق",
    NEXT_STEP: "التالي",
    NOTSET: "لم يتم التعيين.",
    AGREEN: "موافق",
    NOTAGREEN: "غير موافق",
    LEAVE: "مغادرة",
    TYPE_HERE: "Type here",
    CHAT_DOWNLOAD:
      "الرجاء النقر هنا لحفظ نسخة من محادثتك مع خدمة العملاء ASUS على الإنترنت.",
  },
  COUNTRY: { SELECT_COUNTRY: "الرجاء تحديد منطقة الخدمة" },
  POLICY: {
    PRIVACY: "سياسة حماية الخصوصية",
    SAT_SURVEY: "Service Agreement",
    CONFIRM_COUNTRY: {
      H1: "عزيزي عميل ASUS،",
      P1:
        "أنت الآن تزور خدمة العملاء ASUS على الإنترنت لأستراليا، التي تختلف عن منطقتك الحالية. ووفقاً لشروط الضمان في الولايات المتحدة الأمريكية، لا ينطبق كل منتج من منتجات التأمين الاجتماعي الأمريكي على خدمة الضمان والدعم الدولية في الولايات المتحدة. إذا كان الموقع الإقليمي أعلاه الذي تزوره ليس المنطقة التي اشتريت فيها منتج ASUS الخاص بك أو يختلف عن منطقتك الحالية، قد يؤثر على حقوقك. يمكنك الاستمرار في استخدام خدمة العملاء ASUS على الإنترنت لأستراليا أو تغيير خدمة العملاء ASUS على الإنترنت إلى منطقتك.",
      P2: "",
      P3: "",
      B1: "قم بالتبديل إلى ASUS",
      B2: "موقع الكتروني",
      B3: "متابعة الاستخدام",
    },
    BULLETIN: {
      HEAD: "إشعار برسالة هامة",
      CONFIRM: "حسنا، فهمت ذلك",
    },
  },
  SURVEY: {
    SURVEY_ENTER: "يرجى ملء بيانات الاتصال",
    SURVEY_TYPE: "الرجاء تحديد نوع الخدمة",
    PROBLEM_BRIEF: "كيف تصف مشكلتك ؟",
    TYPE1: "سؤال عام",
    TYPE2: "استفسار الإصلاح",
    TYPE3: "الدعم الفني",
    TYPE4: "استفسار عن الضمان",
    TYPE5: "معلومات و ملاحظات",
    EC_TYPE1: "معلومات المنتجات والمبيعات",
    EC_TYPE2: "نشاط التسويق",
    EC_TYPE3: "حالة الشحن والطلب",
    EC_TYPE4: "خدمة المرتجع",
    SIGNUPDATA: "معلومات التسجيل",
    NAME: "الاسم",
    TEL: "رقم الهاتف",
    BIRTHDAY: "تاريخ الميلاد",
    EMAIL: "البريد الإلكتروني",
    DEVICEINFO: "معلومات المنتج",
    DEVICENAME: "اسم المنتج",
    DEVICESN: "رقم التسلسل للمنتج",
    PREPARE: "إنشاء غرفة الدردشة، والاستعداد للدردشة",
    START: "بدء المحادثة",
    AGE_LIMIT: "حد العمر",
    AGE_LIMIT_DESC: "أنت لا تستوفي شروط العمر لاستخدام دردشة ASUS",
    REPEAT_ENTRY: {
      H1: "تم اكتشاف غرفة الدردشة الموجودة",
      P1:
        "هل أنت متأكد من أنك تريد بدء محادثة جديدة؟ عند فتح محادثة جديدة، ستنتهي المحادثة القديمة.",
      B0: "تأكيد",
      B1: "إلغاء",
    },
  },
  CONNECTTING: {
    P1: "الرجاء الانتظار لحظات، ولا تغلق النافذة",
    P2: "دردشة ASUS تقوم بتوصيلك إلى وكيل متاح",
    NOTE: "نصائح",
    BEFORE_LEAVE: "هل تريد بالتأكيد مغادرة هذه الدردشة؟",
    B0: "إنهاء",
    B1: "البقاء والانتظار",
  },
  OFFLIEN: {
    OTHER_CONTACT: "الاتصال ASUS عبر قنوات أخرى",
    MAIL: "تواصل معنا عبر البريد الإلكتروني",
    TEL: "اتصل بنا",
    CLOSE: "إغلاق",
  },
  WAITTING: {
    WATTING_NUM: "المرتبة في قائمة الانتظار",
    PEOPLE: "العميل",
    NOTE: "نصائح",
    BEFORE_LEAVEL: "هل أنت متأكد من الخروج من قائمة الانتظار؟",
    LEAVE_DESC: "إذا لم تعد ترغب في الإنتظار، يمكنك إنهاء الدردشة",
    LEAVE: "إنهاء الدردشة",
    STAY: "البقاء في قائمة الانتظار",
  },
  CHATROOM: {
    TYPING: "الوكيل يكتب...",
    HEAD: {
      CLOSE_AMD_SURVEY: "إنهاء الدردشة",
      TERMINATE: "إنهاء الدردشة",
    },
    FOOTER: { CHAT_FINISH: "انتهت الدردشة" },
    FINISH: "انتهت الدردشة. هل أنت بحاجة إلى أي خدمة إضافية أو دعم؟",
    SAT_SURVEY: {
      SAT: "راض",
      DISSAT: "غير راضي",
      SAT_CHOOSE: "أي نوع من الخدمات؟ (متعددة)",
      HEAD: "هل كنت راض عن الدردشة؟",
      DESC:
        "الاستماع إلى ملاحظاتك هو القوة الدافعة لتحسيننا المستمر. إذا كان لديك أي اقتراحات لخدمات أو دعم ASUS، يرجى إعلامنا.",
      OTHER_OPTION: "أخرى",
      OTHER_REASON: "يرجى ملء السبب الآخر",
      SEND: "إرسال",
    },
    CLOSE: {
      TITLE: "هل أنت متأكد أنك تريد إنهاء هذه الدردشة؟",
      P1:
        'انقر فوق "إنهاء" لإغلاق النافذة. إذا كنت بحاجة إلى استخدام الدردشة مرة أخرى، ستحتاج إلى طلب آخر للمحادثة".',
      B0: "إنهاء",
      B1: "إلغاء",
    },
  },
  ERROR: {
    H1: "غرفة الدردشة غير موجودة أو أن الدردشة قد انتهت بالفعل",
    CLOSE: "أغلاق النافذة",
  },
  CHAT_END: {
    H1: "شكرا جزيلا، لقد انتهت الدردشة الآن",
    CLOSE: "أغلاق النافذة",
  },
  CHAT_CLOSE: {
    H1:
      "لقد توقفت شبكة الاتصال الخاصة بك لأكثر من 300 ثانية، لذلك قمنا بإنهاء هذه المحادثة.",
    DESC:
      "إذا كنت تستخدم شبكة لاسلكية أو شبكة محمولة، يرجى محاولة العثور على موقع يحتوي على إشارة أفضل؛ أو قم بالتبديل إلى اتصال شبكة سلكية، عذراً على الإزعاج",
    CLOSE: "أغلاق النافذة",
  },
  SURVEY_DONE: {
    H1: "شكرا لكم. لقد أكملت استقصاء مدى رضا الخدمة",
    P1:
      'ملاحظاتك هي القوة الدافعة لتحسيننا المستمر. نشكرك على تخصيص الوقت لإكمال استقصاء رضا الخدمات. إذا كنت بحاجة إلى أي خدمة أو دعم إضافي، يرجى النقر فوق "بدء محادثة جديدة". إذا قمنا بحل الاستعلام الخاص بك، يرجى النقر فوق "إغلاق النافذة" لإنهاء المحادثة',
    AGAIN: "بدء دردشة جديدة",
    CLOSE: "أغلاق النافذة",
  },
  AGENT_OFFLINE: {
    H1: "اتصال الوكيل بالإنترنت لا يستجيب؛ محادثتك مقطوعة حاليا",
    H2: "أرجو ألا تغلق النافذة؛ ونحن نعمل جاهدين لاستئناف الدردشة",
    DESC:
      "يمكنك أيضًا اختيار إنهاء الجلسة لإجراء استقصاء، أو انقر فوق 'بدء محادثة جديدة', وسنعين فوراً وكيلاً جديداً لمواصلة الدورة. نأسف لأي إزعاج يسببه",
    AGAIN: "بدء دردشة جديدة",
  },
  VIDEOCALL: {
    MEDIA_NOTALLOW: "Unable to use camera and microphone",
    H1: "Ready to join?",
    P1:
      "In order for ASUS customer service staff to help you solve the problem more efficiently, you must allow the device to access your camera and microphone to join the video chat room, and please ensure that your mobile network connection is stable and functioning normally",
    P2:
      "After accessing, you can still freely set the lens switch and microphone mute.",
    VIDEO_STATE: "Video status",
    VIDEO_ON: "On",
    VIDEO_OFF: "Off",
    AUDIO_STATE: "Audio status",
    AUDIO_ON: "On",
    AUDIO_OFF: "Off",
    ENTER: "Join",
    HANGUP: {
      H1: "Hangup",
      P1: "Are you sure to hangup the viode chat?",
      CONFIRM: "Confirm",
      CANCEL: "Cancel",
    },
    END: {
      H1: "Video Call has ended",
      P1: "Thank you, this video chat is over, you can close this window.",
    },
  },
};
export default lan;
