const lan = {
  REDIRECT: "กำลังดำเนินการ...",
  RULE: {
    SERVICE_TYPE: "กรุณาเลือกประเภทของบริการ",
    COUNTRY: "โปรดเลือกประเทศหรือภูมิภาคของคุณ",
    USERNAME: "กรุณาระบุชื่อผู้ใช้งาน",
    EMAIL: "กรุณาใส่อีเมล",
    EMAIL2: "กรุณาใส่อีเมลให้ถูกต้อง",
    PRODUCT: "กรุณาเลือกผลิตภัณฑ์ของคุณ",
    PRODUCTSN: "กรณาระบุหมายเลขซีเรียลของคุณ",
    PRODUCTSN_LEN: "กรุณาใส่ตัวอักษรหรือตัวเลข 12 ถึง 15 ตัว",
    BIRTHDAY: "กรุณาใส่วันเกิด",
    REQUIRED: "กรุณาระบุ",
  },
  SYS: {
    HEAD: "ระบบ",
    NOSERVICE:
      "ขออภัย การสนทนาออนไลน์ในประเทศหรือภูมิภาคที่คุณเลือกไม่สามารถใช้งานได้.",
    CHECK_FILESIZE: "กรุณาตรวจสอบขนาดของรูปภาพหรือไฟล์แนบ ขนาดไม่เกิน:",
    RECONNECTED: "สถานะการเชื่อมต่อกลับมาเป็นปกติ",
    UNABLE_SEND: "ไม่สามารถส่งไฟล์แนบ",
    NO_NETWORK: "ไม่มีการเชื่อมต่ออินเทอร์เน็ต",
    NO_NETWORK_INFO:
      "ไม่มีการเชื่อมต่ออินเทอร์เน็ต กรุณาเชื่อมต่อใหม่และลองอีกครั้ง",
  },
  IDLE: {
    HEAD: "คุณไม่ได้ใช้งานมาระยะหนึ่งแล้ว คุณต้องการสนทนาต่อหรือไม่?",
    BUTTON: "ดำเนินการต่อ",
  },
  DISCONNECT: {
    HEAD: "การสนทนาเสร็จสิ้น",
    BUTTON: "เสร็จสิ้น",
  },
  LAYOUT: {
    PREV_STEP: "ก่อนหน้า",
    NEXT_STEP: "ถัดไป",
    NOTSET: "ไม่ได้ตั้งค่า",
    AGREEN: "ยอมรับ",
    NOTAGREEN: "ไม่ยอมรับ",
    LEAVE: "ออก",
    TYPE_HERE: "พิมพ์ที่นี่",
    CHAT_DOWNLOAD:
      "คลิกที่นี่เพื่อบันทึกประวัติการสนทนาของคุณกับเจ้าหน้าที่ออนไลน์แชทของ ASUS.",
  },
  COUNTRY: { SELECT_COUNTRY: "โปรดเลือกประเทศหรือภูมิภาคที่ให้บริการ" },
  POLICY: {
    PRIVACY: "นโยบายคุ้มครองความเป็นส่วนตัว",
    SAT_SURVEY: "สัญญาการให้บริการ",
    CONFIRM_COUNTRY: {
      H1: "สวัสดี",
      P1:
        "ท่านกำลังเข้าสู่บริการ ASUS ออนไลน์แชท ประเทศออสเตรเรีย  ซึ่งแตกต่างจากภูมิภาคปัจจุบันของคุณ ตามข้อกำหนดการรับประกันของ ASUS ไม่ใช่ทุกผลิตภัณฑ์ของ ASUS จะใช้ได้กับการรับประกันและการบริการระหว่างประเทศของ ASUS หากไซต์ภูมิภาคด้านบนที่คุณเยี่ยมชมไม่ใช่ภูมิภาคที่คุณซื้อผลิตภัณฑ์ ASUS หรือแตกต่างจากภูมิภาคปัจจุบันของคุณ อาจส่งผลกระทบต่อสิทธิ์การรับประกันของคุณ คุณสามารถใช้ ASUS ออนไลน์แชทสำหรับออสเตรเลียต่อไป หรือเปลี่ยน ASUS ออนไลน์แชทเป็นภูมิภาคของคุณ",
      P2: "",
      P3: "",
      B1: "เปลี่ยนไปใช้ ASUS",
      B2: "เว็บไซต์",
      B3: "ใช้งานต่อ",
    },
    BULLETIN: {
      HEAD: "การแจ้งเตือนข้อความสำคัญ",
      CONFIRM: "รับทราบ",
    },
  },
  SURVEY: {
    SURVEY_ENTER: "โปรดระบุรายละเอียดสำหรับติดต่อของคุณ",
    SURVEY_TYPE: "กรุณาเลือกประเภทบริการ",
    PROBLEM_BRIEF: "กรุณาอธิบายปัญหาของคุณ?",
    TYPE1: "คำถามทั่วไป",
    TYPE2: "สอบถามเกี่ยวกับการซ่อม",
    TYPE3: "ความช่วยเหลือทางเทคนิค",
    TYPE4: "สอบถามเกี่ยวกับการรับประกัน",
    TYPE5: "ความคิดเห็นและข้อเสนอแนะ",
    EC_TYPE1: "ข้อมูลผลิตภัณฑ์และการขาย",
    EC_TYPE2: "กิจกรรมส่งเสริมการขาย",
    EC_TYPE3: "สถานะการจัดส่งและการสั่งซื้อ",
    EC_TYPE4: "บริการส่งคืนสินค้า",
    SIGNUPDATA: "ข้อมูลการลงทะเบียนของคุณ",
    NAME: "ชื่อ",
    TEL: "หมายเลขโทรศัพท์",
    BIRTHDAY: "วันเดือนปีเกิด",
    EMAIL: "อีเมล",
    DEVICEINFO: "ข้อมูลผลิตภัณฑ์ของคุณ",
    DEVICENAME: "ชื่อผลิตภัณฑ์",
    DEVICESN: "หมายเลขซีเรียล",
    PREPARE: "กำลังสร้างห้องสนทนา เตรียมพร้อมสำหรับการสนทนา",
    START: "เริ่มการสนทนา",
    AGE_LIMIT: "อายุไม่ต่ำกว่า",
    AGE_LIMIT_DESC: "คุณอายุไม่ถึงเกณฑ์ที่จะใช้บริการ ASUS แชทออนไลน์",
    REPEAT_ENTRY: {
      H1: "ตรวจสอบพบว่ามีห้องสนทนาเปิดอยู่แล้ว",
      P1:
        "คุณแน่ใจหรือไม่ว่าต้องการเริ่มการสนทนาใหม่? เมื่อเปิดการสนทนาใหม่ การสนทนาเก่าจะสิ้นสุดลง",
      B0: "ยืนยัน",
      B1: "ยกเลิก",
    },
  },
  CONNECTTING: {
    P1: "กรุณารอสักครู่และอย่าปิดหน้าต่างสนทนานี้",
    P2: "ASUS ออนไลน์แชทกำลังเชื่อมต่อคุณกับเจ้าหน้าที่",
    NOTE: "คำเตือน",
    BEFORE_LEAVE: "คุณแน่ใจหรือไม่ว่าต้องการยกเลิก ASUS ออนไลน์แชท?",
    B0: "เสร็จสิ้น",
    B1: "กรุณารอสักครู่และอย่าออกจากหน้านี้",
  },
  OFFLIEN: {
    OTHER_CONTACT: "ติดต่อ ASUS ผ่านช่องทางอื่นๆ",
    MAIL: "ส่งอีเมลถึงเรา",
    TEL: "โทรหาเรา",
    CLOSE: "ปิด",
  },
  WAITTING: {
    WATTING_NUM: "ลำดับคิว",
    PEOPLE: "ลูกค้า",
    NOTE: "การเตือน",
    BEFORE_LEAVEL: "คุณแน่ใจหรือไม่ว่าต้องการออกจากคิว?",
    LEAVE_DESC: "หากคุณต้องการออกจากคิว คุณสามารถจบการแชทได้",
    LEAVE: "จบการแชท",
    STAY: "รออยู่ในคิว",
  },
  CHATROOM: {
    TYPING: "เจ้าหน้าที่กำลังพิมพ์...",
    HEAD: {
      CLOSE_AMD_SURVEY: "สิ้นสุดการสน",
      TERMINATE: "จบการแชท",
    },
    FOOTER: { CHAT_FINISH: "การสนทนาเสร็จสิ้น" },
    FINISH:
      "การสนทนาเสร็จสิ้น คุณต้องการความช่วยเหลือหรือบริการอื่นๆเพิ่มเติมหรือไม่?",
    SAT_SURVEY: {
      SAT: "พึงพอใจ",
      DISSAT: "ไม่พอใจ",
      SAT_CHOOSE: "บริการประเภทใด? (หลายรายการ)",
      HEAD: "คุณพึงพอใจกับบริการแชทหรือไม่?",
      DESC:
        "การรับฟังความคิดเห็นของคุณเป็นแรงผลักดันในการพัฒนาอย่างต่อเนื่องของเรา โปรดแจ้งให้เราทราบหากคุณมีคำแนะนำสำหรับการบริการหรือการสนับสนุนของ ASUS",
      OTHER_OPTION: "เหตุผลอื่นๆ",
      OTHER_REASON: "กรุณาใส่เหตุผลอื่นๆ",
      SEND: "ส่ง",
    },
    CLOSE: {
      TITLE: "คุณแน่ใจว่าหรือไม่ ว่าต้องการออกจากแชทนี้?",
      P1:
        'คลิก "เสร็จสิ้น" เพื่อปิดหน้าต่างการสนทนา หากคุณต้องการใช้บริการแชทอีกครั้ง กรุณาคลิก "เริ่มการสนทนาใหม่" .',
      B0: "เสร็จสิ้น",
      B1: "ยกเลิก",
    },
  },
  ERROR: {
    H1: "ไม่มีห้องสนทนานี้หรือการสนทนาเสร็จสิ้นไปแล้ว",
    CLOSE: "ปิดหน้าต่างนี้",
  },
  CHAT_END: {
    H1: "การสนทนาสิ้นสุด ขอบพระคุณที่ใช้บริการ",
    CLOSE: "ปิดหน้าต่างนี้",
  },
  CHAT_CLOSE: {
    H1:
      "เครือข่ายอินเทอร์เน็ตของคุณหยุดทำงานนานกว่า 300 วินาที เราจึงยุติการสนทนานี้",
    DESC:
      "หากคุณใช้เครือข่ายไร้สายหรือเครือข่ายมือถือ โปรดลองค้นหาตำแหน่งที่มีสัญญาณดีกว่า หรือเปลี่ยนไปใช้การเชื่อมต่อเครือข่ายแบบมีสาย ขออภัยในความไม่สะดวก",
    CLOSE: "ปิดหน้าต่างนี้",
  },
  SURVEY_DONE: {
    H1: "ขอบคุณสำหรับการทำแบบสำรวจความพึงพอใจในการให้บริการ",
    P1:
      'คำติชมของคุณคือแรงผลักดันให้เราพัฒนาปรับปรุงอย่างต่อเนื่อง ขอขอบคุณที่สละเวลาตอบแบบสำรวจความพึงพอใจในบริการ หากคุณต้องการรับบริการหรือการสนับสนุนเพิ่มเติม โปรดคลิก "เริ่มแชทใหม่" โปรดคลิก "ปิดหน้าต่าง" เพื่อสิ้นสุดการแชท หากเราได้แก้ไขปัญหาหรือข้อสงสัยของคุณแล้ว',
    AGAIN: "เริ่มการแชทใหม่",
    CLOSE: "ปิดหน้าต่างนี้",
  },
  AGENT_OFFLINE: {
    H1:
      "การเชื่อมต่ออินเทอร์เน็ตของเจ้าหน้าที่ไม่ตอบสนอง ขณะนี้การแชทของคุณถูกรบกวน",
    H2: "กรุณาอย่าปิดหน้าต่างนี้ เรากำลังพยายามกลับสู่หน้าแชทของคุณ",
    DESC:
      'คุณสามารถเลือกที่จะจบการสนทนานี้หรือคลิก "เริ่มแชทใหม่" และเราจะให้เจ้าหน้าที่ท่านใหม่มาสนทนากับคุณต่อ ขออภัยในความไม่สะดวก',
    AGAIN: "เริ่มแชทใหม่",
  },
  VIDEOCALL: {
    MEDIA_NOTALLOW: "Unable to use camera and microphone",
    H1: "Ready to join?",
    P1:
      "In order for ASUS customer service staff to help you solve the problem more efficiently, you must allow the device to access your camera and microphone to join the video chat room, and please ensure that your mobile network connection is stable and functioning normally",
    P2:
      "After accessing, you can still freely set the lens switch and microphone mute.",
    VIDEO_STATE: "Video status",
    VIDEO_ON: "On",
    VIDEO_OFF: "Off",
    AUDIO_STATE: "Audio status",
    AUDIO_ON: "On",
    AUDIO_OFF: "Off",
    ENTER: "Join",
    HANGUP: {
      H1: "Hangup",
      P1: "Are you sure to hangup the viode chat?",
      CONFIRM: "Confirm",
      CANCEL: "Cancel",
    },
    END: {
      H1: "Video Call has ended",
      P1: "Thank you, this video chat is over, you can close this window.",
    },
  },
  GPT: {
    LAYOUT: {
      AGREE: "Agree",
      START: "Start",
      CANCEL: "Cancel",
      WAIT: "Please wait",
      INPUT: "Eenter text",
      TRANSFER_TOAGENT: "Transfer to agent.",
      READMORE: "You can also refer to the following related FAQ, thank you.",
      COLLAPSE: "Hide",
    },
    HEAD: {
      LEAVE: "Leave",
      CREATE_NEW: "Create New Room",
    },
    ENTRANCE: {
      POLICY: "Privacy Policy",
      AGREE: "Click Agree to start the conversation",
    },
    MESSAGE: {
      WAIT: "Please wait, we are looking for a solution for you.",
    },
    END: "Conversation ended",
    END_MSG: "We're happy to serve you. The conversation is over.",
    BACKHOME: "Return to homepage",
  },
};
export default lan;
